const TreeData = [
  {
    id: 1,
    label: "1 - الأصول",
    open: true,
    children: [
      {
        id: 6,
        label: "1001 - الأصول المتداولة",
        open: true,
        children: [
          {
            id: 10,
            label: "1001001 - النقدية",
            children: [
              {
                id: 50,
                label: "1001001001 - الصندوق الرئيسي",
                children: [
                  { id: 72, label: "1001001001001 - نقدا (طرق الدفع)" },
                ],
              },
            ],
          },
          {
            id: 11,
            label: "1001002 - حسابات بنكية",
            children: [
              { id: 48, label: "1001002001 - حساب البنك الرئيسي" },
              { id: 49, label: "1001002002 - حساب بنك الاستثمار" },
              { id: 73, label: "1001002003 - تحويل بنكي (طرق الدفع)" },
              { id: 79, label: "1001002004 - شبكة (طرق الدفع)" },
            ],
          },
          {
            id: 12,
            label: "1001003 - أوراق قبض",
            children: [
              { id: 85, label: "1001003001 - شيكات آجلة (طرق الدفع)" },
            ],
          },
        ],
      },
    ],
  },
  {
    id: 2,
    label: "2 - الخصوم",
    children: [
      {
        id: 20,
        label: "2001 - الخصوم المتداولة",
        children: [
          {
            id: 21,
            label: "2001001 - الدائنون",
            children: [
              { id: 47, label: "2001001001 - الموردين" },
              { id: 70, label: "2001001002 - الموردون (مرتبط بالفواتير)" },
            ],
          },
          {
            id: 22,
            label: "2001002 - الالتزامات الضريبية",
            children: [
              {
                id: 44,
                label: "2001002001 - ضريبة القيمة المضافة على المبيعات",
              },
              {
                id: 77,
                label: "2001002002 - ضريبة القيمة المضافة على المشتريات",
              },
              {
                id: 80,
                label: "2001002003 - ضريبة القيمة المضافة على المصروفات",
              },
            ],
          },
          {
            id: 23,
            label: "2001003 - مصاريف مستحقة",
            children: [
              { id: 78, label: "2001003001 - الرواتب المستحقة" },
              { id: 82, label: "2001003002 - مصروفات الموظفين" },
            ],
          },
        ],
      },
    ],
  },
  {
    id: 3,
    label: "3 - حقوق الملكية",
    children: [
      {
        id: 30,
        label: "3001 - حقوق الملكية",
        children: [
          { id: 31, label: "3001001 - رأس المال" },
          { id: 32, label: "3001002 - الأرباح المرحلة" },
          { id: 33, label: "3001003 - صافي الدخل" },
        ],
      },
    ],
  },
  {
    id: 4,
    label: "4 - الإيرادات",
    children: [
      {
        id: 40,
        label: "4001 - الإيرادات",
        children: [
          { id: 21, label: "4001001 - إيرادات المبيعات" },
          { id: 76, label: "4001002 - مردودات المبيعات" },
        ],
      },
    ],
  },
  {
    id: 5,
    label: "5 - المصروفات",
    children: [
      {
        id: 50,
        label: "5001 - المصروفات",
        children: [
          { id: 55, label: "5001001 - مشتريات بضائع" },
          { id: 75, label: "5001002 - مردودات المشتريات" },
          { id: 84, label: "5001003 - مصروفات عمومية وإدارية" },
          { id: 86, label: "5001004 - مصروفات بيعية وتوزيعية" },
          { id: 88, label: "5001005 - العملاء" },
          { id: 90, label: "5001006 - خصم مسموح به" },
          { id: 91, label: "5001007 - خصم مكتسب" },
        ],
      },
    ],
  },
];

export default TreeData;
